# Я не знаю, проходили ли ребята штуку raise(для "крафтовых исключений"),
# но я точно помню, что было try/except, поэтому для оптимизации использовала эту логику

print("| РУЛЕТКА |")

try:
    num = int(input("Введите номер кармана рулетки: "))

    if num < 0 or num > 36:
        raise ValueError("Упс! Такого кармана нет.")

except ValueError as e:     # "ловим" сразу два исключения (некорр.ввод или само число)
    print(f"Ошибка! {e}")
    
color = None    # переменная цвета, которая определиться по ходу проверки

if num == 0: color = "зеленый"

elif 1<=num<=10 or 19<=num<=28:     # идентичное условие проверок 
    if num%2 == 0: color = "черный"
    else: color = "красный"

elif 11<=num<=18 or 29<=num<=36:
    if num%2 == 1: color = "черный"
    else: color = "красный"


print(f"Цвет кармана - {color}")




