
def det_color(x, y):
    """
    Определяет, какого цвета клетка.
    Мы видим, что клетки черные, если столбец четный и строка нечетная
    или если столбец нечетный и строка четная. Значит, остальные клетки белые
    и нет смысла проверять их.

    Args: x, y (int) - координаты соответственно
    Return: 0 (int) если клетка черная, 1 - если белая
    """

    if (x%2==0 and y%2==1) or (x%2==1 and y%2==0): return 0
    else: return 1


try:
    x1, y1 = map(int, input ("Введите координаты первой клетки столбец/строка: ").split())
    x2, y2 = map(int, input ("Введите координаты второй клетки столбец/строка: ").split())

    if any(a<1 or a>8 for a in (x1, y1, x2, y2)):  # проверяем условие соответствия для всех введенных значений
        raise ValueError("Упс! Мы за пределами доски.")

except ValueError as e:
    print(f"Ошибка ввода! {e}")


if det_color(x1,y1) == det_color(x2,y2): print("YES")
else: print("NO")
