import math

try:
    x1, y1 = map(int, input("Введите координаты первой клетки: ").split())
    x2, y2 = map(int, input("Введите координаты второй клетки: ").split())

    if any(a<1 or a>8 for a in (x1, y1, x2, y2)):
        raise ValueError("Упс! Мы за пределами доски.")
except ValueError as e:
    print(f"Ошибка ввода! {e}")

# Движение по диагонали уже объяснялось. Заметим, что движение вверх-вниз
# и вправо-влепо математически выполняется тогда, когда равны столбцы или равны строки.
# Поэтому просто добавляем это условие с or 
if x1 == x2 or y1 == y2 or abs(x1 - x2) == abs(y1 - y2):
    print("YES")
else:
    print("NO")

